; hello-l.asm
; Виводить на екран повідомлення "'Hello World!" і завершується 

.model tiny ; модель пам’яти, яка використовується для СОМ

.code ; початок сегменту коду
org 100h ; початкове значення лічильник - 100h

start: mov ah, 09h ; номер функції DOS: виведення на екран - в АН записується код функції

mov dx, offset message ; зсув до змінної у сегменті даних пишемо в DX

int 21h ; виклик системної функції DOS: вивести рядок на екран 
ret ;завершення СОМ-програми, вихід в MS DOS
message db "Hello World!",0Dh,0Ah,"$" ; рядок для виведення символи управління
; 0dh – Return (повернення  каретки), 0ah – Line feed (переведення рядка)
End start   ; кінець програми