; hello-l.asm

; Виводить на екран повідомлення "'Hello World!" і завершується 
.model small ; модель пам’яті, яка використовується для EXE- файлів

.stack 100h ; сегмент стеку розміром 256 байт ; У сегменті даних

.data
message db "Hello World!",0Dh,0Ah,"$" ; рядок для виведення тексту та символи управління

; У сегменті команд
.code    ; початок сегменту кода
start:
  mov ax, @data
  mov ds, ax
  mov ah, 09h ; номер функції DOS: виведення на екран - в АН записується код функції
  mov dx,offset message ; зсув до змінної у сегменті даних  пишемо в DX
  int 21h ; виклик системної функції DOS: вивести рядок на екран
  mov  ax, 4c00h  ; код успішного завершення програми та вивантаження її з пам’яті
  int 21h
end start ; кінець програми